#include <stdio.h>

int main(){
    int a,b,c,sum;
    printf("Enter 3 Number : ");
    scanf("%d %d %d",&a,&b,&c);
    sum = a+b+c;
    
    printf("ANSWER = %d\n",sum);
    if(sum%2==0 || sum == 3){
        printf("EVEN");
    }
    else{
        printf("ODD");
    }
    return 0;
}

// โปรแกรมนี้ทำหน้าที่รับข้อมูลจากผู้ใช้เกี่ยวกับตัวเลข 3 จำนวนและทำการคำนวณผลรวมของตัวเลขเหล่านั้น และตรวจสอบว่าผลรวมนั้นเป็นเลขคู่หรือเลขคี่ ดังนี้:

// โปรแกรมจะแสดงข้อความ "Enter 3 Number : " เพื่อขอให้ผู้ใช้ป้อน 3 จำนวนเต็ม (a, b, และ c) โดยใช้ scanf เพื่อรับข้อมูลที่ผู้ใช้ป้อน.

// โปรแกรมจะทำการคำนวณผลรวมของตัวเลขทั้ง 3 จำนวน (sum) โดยใช้สมการ sum = a + b + c.

// โปรแกรมจะแสดงผลลัพธ์ของผลรวมนั้น ด้วยข้อความ "ANSWER = {ผลรวม}".

// โปรแกรมจะทำการตรวจสอบว่าผลรวม (sum) เป็นเลขคู่หรือเลขคี่ โดยใช้เงื่อนไข if-else ดังนี้:

// ถ้า sum หารด้วย 2 ลงตัว (เช่น sum % 2 == 0) หรือ sum เท่ากับ 3 โปรแกรมจะแสดงข้อความ "EVEN" เพื่อบอกว่าผลรวมเป็นเลขคู่หรือเท่ากับ 3.
// ถ้าไม่เป็นเงื่อนไขข้างต้น โปรแกรมจะแสดงข้อความ "ODD" เพื่อบอกว่าผลรวมเป็นเลขคี่ที่ไม่เข้าเงื่อนไขข้างต้น.