#include <stdio.h>
int main()
{
    int num, count = 0;
    printf(" *** divisible number ***\nEnter a positive number : ");
    scanf("%d", &num);
    if (num == 0){
        printf("%d is OUT of range !!! ", num);
    }
    else{
        printf("Output ==> ");
        for (int i = 1; i <= num; i++){
            if (num % i == 0){
                printf("%d ", i);
                count++;
            }
        }
        printf("\nTotal ==> %d", count);
    }

    return 0;
}



// โปรแกรมนี้ทำหน้าที่รับจำนวนเต็มบวกจากผู้ใช้และคำนวณและแสดงตัวเลขที่หารจำนวนนั้นลงตัว (ตัวเลขที่หารจำนวนนั้นๆ ได้โดยไม่มีเศษ) และนับจำนวนตัวเลขเหล่านั้น ดังนี้:

// โปรแกรมจะแสดงข้อความ "Enter a positive number : " เพื่อขอให้ผู้ใช้ป้อนจำนวนเต็มบวก (num) โดยใช้ scanf เพื่อรับข้อมูลที่ผู้ใช้ป้อน.

// โปรแกรมจะตรวจสอบว่า num เป็น 0 หรือไม่ ถ้า num เป็น 0 จะแสดงข้อความ "%d is OUT of range !!! " เพื่อแจ้งว่า num ไม่อยู่ในช่วงที่สามารถประมวลผลได้ แล้วจะสิ้นสุดการทำงานของโปรแกรม.

// ถ้า num ไม่เป็น 0, โปรแกรมจะแสดงข้อความ "Output ==> " เพื่อเตรียมแสดงตัวเลขที่หาร num ลงตัว.

// โปรแกรมจะทำการลูป for ตั้งแต่ i เริ่มต้นที่ 1 และเพิ่มขึ้นทีละ 1 จนถึง num.

// ในแต่ละรอบของลูป for, โปรแกรมจะตรวจสอบว่า num หาร i ลงตัวหรือไม่ โดยใช้ if (num % i == 0) ถ้าลงตัวจะแสดงค่า i และเพิ่มค่า count ขึ้น 1.

// โปรแกรมจะแสดงตัวเลขที่ num หารลงตัวและจำนวนตัวเลขเหล่านั้น.