#include <stdio.h>

int main(){
    int a, b;
    printf(" *** Arithmetic Sequence ***\n");
    printf("Enter 2 Positive Integers: ");
    scanf("%d %d", &a, &b);
    for(int i = 9; i >= 0; i--){
        printf("%d ", a + (b * i));
    }

    return 0;
}
// โปรแกรมนี้เป็นโปรแกรมที่ใช้ในการแสดงลำดับเลขคณิตแบบเรียง โดยมีการคำนวณค่าของแต่ละสมาชิกในลำดับแล้วแสดงผลลัพธ์ในลำดับที่เรียงลงมาด้วยลูป for:

// โปรแกรมจะแสดงข้อความ "Arithmetic Sequence" เพื่อแสดงว่าโปรแกรมนี้เป็นการคำนวณลำดับเลขคณิต.

// โปรแกรมจะขอให้ผู้ใช้ป้อน 2 จำนวนเต็มบวกที่เรียงกัน โดยใช้ scanf เพื่อรับข้อมูลที่ผู้ใช้ป้อนและจัดเก็บในตัวแปร a และ b ตามลำดับ.

// โปรแกรมจะใช้ลูป for เพื่อคำนวณและแสดงลำดับเลขคณิต. ลูป for นี้จะทำงาน 10 รอบ (จาก i = 9 ถึง i = 0) เพื่อคำนวณและแสดงค่าของแต่ละสมาชิกในลำดับ.

// ในแต่ละรอบของลูป for โปรแกรมจะคำนวณค่าของสมาชิกในลำดับโดยใช้สูตร a + (b * i) และแสดงค่านั้นในลำดับที่เรียงลงมา.

// เมื่อลูป for ทำงานเสร็จสิ้น โปรแกรมจะสิ้นสุดการทำงานและสิ้นสุดโปรแกรม