#include <stdio.h>
int main(){
    int a, b, min, max, sum=0;
    printf(" *** Display Summation ***\n");
    printf("Enter 2 whole numbers : ");
    scanf("%d %d", &a, &b);
    if(a<b){
        min=a;
        max=b;
    }
    else{
        min=b;
        max=a;
    }

    printf("Summation = ");
    for(int i=min;i<=max;i++){
        sum+=i;
        if(i==max){
            printf("%d = %d",i,sum);
        }else{
            printf("%d + ",i);
        }
    }
    return 0;
}

// โปรแกรมนี้เป็นโปรแกรมที่ใช้ในการคำนวณผลรวมของจำนวนเต็มระหว่างค่าที่ผู้ใช้ป้อน a และ b โดยแสดงผลลัพธ์การบวกที่ใช้ในการคำนวณผลรวมนี้:

// โปรแกรมจะแสดงข้อความ "Display Summation" เพื่อแสดงว่าโปรแกรมนี้เป็นการคำนวณผลรวม.

// โปรแกรมจะขอให้ผู้ใช้ป้อน 2 จำนวนเต็มโดยใช้ scanf เพื่อรับข้อมูลที่ผู้ใช้ป้อนและจัดเก็บในตัวแปร a และ b.

// โปรแกรมจะทำการเปรียบเทียบค่า a และ b เพื่อหาค่าที่น้อยที่สุด (min) และค่าที่มากที่สุด (max) จากนั้นจะทำการคำนวณผลรวมของจำนวนเต็มระหว่าง min และ max.

// โปรแกรมจะใช้ลูป for เพื่อทำการคำนวณผลรวมของจำนวนเต็มทุกตัวระหว่าง min และ max โดยเพิ่มค่าของแต่ละจำนวนเข้ากับ sum และแสดงผลลัพธ์การบวกที่ใช้ในการคำนวณผลรวม.

// เมื่อลูป for ทำงานจนถึงค่า max โปรแกรมจะแสดงผลรวมของจำนวนเต็มทั้งหมดในลำดับรวมถึงค่าของผลรวมเป็น "Summation = ผลรวม" บนหน้าจอ.

// โปรแกรมจะสิ้นสุดการทำงานและสิ้นสุดโปรแกรม.