#include <stdio.h>

int main(){
    int a1, a2, n, i, a3;
    printf("******** Fibonacci series ********\n");
    printf("*  A(1) and A(2) are assigned.   *\n");
    printf("*     A(n) = A(n-1) + A(n-2)     *\n");
    printf("*--------------------------------*\n\n");
    printf("Enter A1 A2 n : ");
    scanf("%d %d %d", &a1, &a2, &n);
    printf("\n%d %d ", a1, a2);
    for(i=3; i<=n; i++){
        a3 = a1 + a2;
        printf("%d ", a3);
        a1 = a2;
        a2 = a3;
    }
    return 0;
}


// โปรแกรมนี้เป็นโปรแกรมที่ใช้ในการคำนวณและแสดงลำดับของตัวเลข Fibonacci โดยมีข้อความอธิบายดังนี้:

// โปรแกรมจะแสดงข้อความ "Fibonacci series" เพื่อแสดงว่าโปรแกรมนี้เป็นการคำนวณลำดับ Fibonacci.

// โปรแกรมจะแสดงข้อความ "A(1) and A(2) are assigned." เพื่อแสดงว่าต้องมีการกำหนดค่าให้กับ A(1) และ A(2) ก่อน โดยตามสูตร A(n) = A(n-1) + A(n-2).

// โปรแกรมจะขอให้ผู้ใช้ป้อนค่า A(1), A(2), และ n โดยใช้ scanf เพื่อรับข้อมูลที่ผู้ใช้ป้อนและจัดเก็บในตัวแปร a1, a2, และ n.

// โปรแกรมจะแสดงค่า a1 และ a2 ในลำดับ Fibonacci และเริ่มลูป for เพื่อคำนวณและแสดงค่าตัวถัดไปในลำดับ Fibonacci โดยเริ่มต้นที่ i=3 (A(3) เป็นตัวถัดไป).

// ในแต่ละรอบของลูป for, โปรแกรมจะคำนวณค่า A(3) และค่าต่อไปในลำดับ Fibonacci โดยใช้สูตร A(n) = A(n-1) + A(n-2) และแสดงค่านั้นในลำดับ.

// โปรแกรมจะทำงานจนถึงค่า n ที่ผู้ใช้ป้อนและแสดงค่าตัวสุดท้ายในลำดับ Fibonacci.