#include <stdio.h>
int main(){
    int x,y,sum;
    printf(" *** Power ***\n");
    printf("Enter 2 Positive Integers: ");
    scanf("%d %d",&x,&y);
    printf("%d",x);
    sum = x;
    for(int i=1;i<y;i++){
        printf(" x %d",x);
        sum *= x;
    }
    printf(" = %d",sum);
    return 0;
}



// โปรแกรมนี้ใช้ในการคำนวณการยกกำลังของจำนวนเต็มสองจำนวนที่ผู้ใช้ป้อน โดยมีการอธิบายการทำงานดังนี้:

// โปรแกรมจะแสดงข้อความ "Enter 2 Positive Integers: " เพื่อรับจำนวนเต็มบวกสองจำนวนจากผู้ใช้.

// ผู้ใช้จะป้อนสองจำนวนเต็มบวกที่ต้องการนำมาทำการยกกำลัง โปรแกรมจะอ่านค่าเหล่านี้โดยใช้ scanf และเก็บในตัวแปร x และ y.

// โปรแกรมจะแสดงผลลัพธ์แรกที่คือค่าของ x โดยใช้ printf.

// โปรแกรมจะประกาศตัวแปร sum และกำหนดค่าเริ่มต้นให้เป็นค่าของ x.

// จากนั้น โปรแกรมจะเข้าสู่ลูป for ซึ่งจะทำการวนลูป y - 1 ครั้ง เพื่อคำนวณการยกกำลัง x ด้วยค่า y.

// ในแต่ละรอบของลูป for โปรแกรมจะแสดงข้อความ " x " และค่า x จากนั้นจะคำนวณค่า sum โดยการคูณ sum ด้วย x และเก็บผลลัพธ์ลงใน sum.

// เมื่อลูป for ทำงานเสร็จสิ้น โปรแกรมจะแสดงผลลัพธ์การยกกำลังที่ถูกคำนวณและจบการทำงาน.

// ตัวอย่างการทำงาน:
// ถ้าผู้ใช้ป้อนค่า x เป็น 2 และค่า y เป็น 3, โปรแกรมจะคำนวณ 2^3 และแสดงผลลัพธ์เป็น "2 x 2 x 2 = 8".