#include <stdio.h>
int num[8][10] = {    2,    3,     5,     7,  11,  13,   17,   19,   29,  31, 

                      			  37,  41,   43,   37,  61,  71,   73,   79,   83,  97, 

                      			103, 107, 109, 113, 131, 151, 181, 191, 193, 173, 

                      			163, 113, 102, 107, 127, 137, 257, 139, 149, 369,

                      			212, 224, 236, 248, 313, 326, 339, 341, 355, 368,

                      		 	   2,    4,     6,     6,  10,   12,   14,   16,   18,  20, 

                      			   1,    3,     5,     7,    9,   11,   13,   17,   19,  21, 

                     			163, 113, 102, 107, 127, 137, 257, 139, 149, 369 };
int main(){
    int i,j;
    int value;
    int found = 0;
    int count = 0;
    printf(" *** Find a value in array 2 dimension ***\n");
    printf("Enter a value : ");
    scanf("%d",&value);

    for (i = 0; i < 8; i++) {
        for (j = 0; j < 10; j++) {
            printf("%5d", num[i][j]);
        }
        printf("\n");
    }
    printf("\n");
    for(i=0;i<8;i++){
        for(j=0;j<10;j++){
            if(num[i][j] == value){
                count++;
                if (count == 1) {
                    printf("Finding value => %d\n", value);
                    count++;
                }
                printf("%d. (row,column) => (%d,%d)\n",count-1,i+1,j+1);
                found = 1;
            }
        }
    }
    if(found == 0){
        printf("Finding value => %d\n",value);
        printf(" --- !!! NOT FOUND !!! ---\n");
    }
    return 0;
}


// โปรแกรมนี้มีวัตถุประสงค์ในการค้นหาค่าในอาร์เรย์ 2 มิติและแสดงตำแหน่งที่พบค่านั้น (ถ้ามี) และแสดงจำนวนครั้งที่ค่านั้นปรากฏในอาร์เรย์ 2 มิตินี้ โดยมีการทำงานดังนี้:

// โปรแกรมจะประกาศและกำหนดค่าในอาร์เรย์ 2 มิติ num ที่มีขนาด 8x10 และมีข้อมูลค่าต่างๆอยู่ในอาร์เรย์นี้ โดยแบ่งเป็น 4 ส่วนเท่ากัน แต่ละส่วนเก็บค่าต่างๆ ที่ต่างกัน.

// ใน main function, โปรแกรมจะรับค่า value จากผู้ใช้ ซึ่งเป็นค่าที่ต้องการค้นหาในอาร์เรย์ 2 มิติ.

// โปรแกรมจะแสดงอาร์เรย์ 2 มิติ num บนหน้าจอเพื่อให้ผู้ใช้เห็นค่าทั้งหมดที่อยู่ในอาร์เรย์นี้.

// หลังจากนั้น, โปรแกรมจะทำการสแกนอาร์เรย์ 2 มิติ num ด้วยการใช้ลูป for ซ้อนกันสองชั้นเพื่อค้นหาค่า value ในอาร์เรย์.

// เมื่อค่า value ถูกพบ, โปรแกรมจะเพิ่มตัวแปร count ขึ้นแสดงว่าพบ value ครั้งที่เท่าไร และแสดงตำแหน่ง (row, column) ที่พบค่า value.

// หาก value ไม่ถูกพบเลยในอาร์เรย์, โปรแกรมจะแสดงข้อความว่า "NOT FOUND".

// โปรแกรมจะสิ้นสุดการทำงานและแสดงผลลัพธ์บนหน้าจอ.

// ดังนั้น, โปรแกรมนี้ทำงานโดยรับค่า value จากผู้ใช้และค้นหาค่านี้ในอาร์เรย์ 2 มิติ num และแสดงผลลัพธ์และตำแหน่งที่พบ value ในภาษา C