/*
 * กลุ่มที่  : 23010141
 * 63010870 วัชรพล โยธาดี
 * chapter : 1	item : 5	ครั้งที่ : 0034
 * Assigned : Thursday 6th of July 2023 08:12:38 PM --> Submission : Wednesday 12th of July 2023 08:51:18 AM	
 * Elapsed time : 7958 minutes.
 * filename : 5.c
 */
#include <stdio.h>

int main() {
    printf("0123456789abcdefghij0123456789abcdefghij0123456789abcdefghij0123456789abcdefghij\n");
    printf("          1234567890          1234567890          1234567890          1234567890\n");
    printf("0123456789          0123456789          0123456789          0123456789          \n");
    printf("          1234567890          1234567890          1234567890          1234567890\n");
    printf("12345678123456781234567812345678123456781234567812345678123456781234567812345678\n");
    // pattern ลองดูจากผลทำแบบนี้ไม่ต้องปริ้นช่องว่าง
    printf("%9s%9s%9s%9s%9s%9s%9s%9s\n","1","12","123","1234","12345","123456","1234567","12345678");
     // pattern ลองดูจากผลทำแบบนี้ จะเริ่มปริ้นทางด้านซ้ายก่อนเพราะเครื่องหมายลบ
    printf("%-8s%-8s%-8s%-8s%-8s%-8s%-8s%-8s%-8s%-8s\n","","1","12","123","1234","12345","123456","1234567","12345678","");
     // pattern ลองดูจากผลทำแบบนี้ผิดเพราะมันปริ้นจากทางขวาก่อนทำให้ไม่ตรงตามแบบ
    // printf("%8s%8s%8s%8s%8s%8s%8s%8s%8s%8s\n","","1","12","123","1234","12345","123456","1234567","12345678","");
    printf("12345678\t12345678\t12345678\t12345678\t12345678");
    return 0;
}